{
	"FormatVersion": 2,
	"Namespace": "",
	"Subnamespaces": [
		{
			"Namespace": "Asset_Direct",
			"Children": [
				{
					"Source":
					{
						"Text": "This is a text literal asigned directly in TextBlock's Text property."
					},
					"Translation":
					{
						"Text": "Se trata de un literal de texto asignado directamente en la propiedad Text de TextBlock."
					},
					"Key": "text_literal_asset_1"
				}
			]
		},
		{
			"Namespace": "Cpp_Namespace_1",
			"Children": [
				{
					"Source":
					{
						"Text": "This is the first text literal created in code."
					},
					"Translation":
					{
						"Text": "Este es el primer literal de texto creado en código."
					},
					"Key": "Cpp_TextLiteral_1"
				}
			]
		},
		{
			"Namespace": "Cpp_Namespace_2",
			"Children": [
				{
					"Source":
					{
						"Text": "This is the second text literal created in code."
					},
					"Translation":
					{
						"Text": "Este es el segundo literal de texto creado en código."
					},
					"Key": "Cpp_TextLiteral_2"
				}
			]
		},
		{
			"Namespace": "ST_Animals",
			"Children": [
				{
					"Source":
					{
						"Text": "cat"
					},
					"Translation":
					{
						"Text": "gato"
					},
					"Key": "st_cpp_animals_cat"
				},
				{
					"Source":
					{
						"Text": "dog"
					},
					"Translation":
					{
						"Text": "perro"
					},
					"Key": "st_cpp_animals_dog"
				}
			]
		},
		{
			"Namespace": "ST_Fruits",
			"Children": [
				{
					"Source":
					{
						"Text": "apple"
					},
					"Translation":
					{
						"Text": "manzana"
					},
					"Key": "st_aset_fruits_apple"
				},
				{
					"Source":
					{
						"Text": "banana"
					},
					"Translation":
					{
						"Text": "plátano"
					},
					"Key": "st_asset_fruits_banana"
				},
				{
					"Source":
					{
						"Text": "strawberry"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "st_assets_fruits_strawberry"
				}
			]
		},
		{
			"Namespace": "ST_TextLocalization_Menu",
			"Children": [
				{
					"Source":
					{
						"Text": "Below you can find some examples of different ways of setting up a localizable text. Each example has additional information written in yellowish color explaining its setup."
					},
					"Translation":
					{
						"Text": "A continuación encontrará algunos ejemplos de diferentes formas de configurar un texto localizable. Cada ejemplo tiene información adicional escrita en color amarillento que explica su configuración."
					},
					"Key": "introduction_info"
				},
				{
					"Source":
					{
						"Text": "Bonus - non-localized text examples:"
					},
					"Translation":
					{
						"Text": "Bonus - ejemplos de texto no localizado:"
					},
					"Key": "section_title_missing_localization"
				},
				{
					"Source":
					{
						"Text": "Creating text literals directly in an asset by using FText property."
					},
					"Translation":
					{
						"Text": "Creación de literales de texto directamente en un activo mediante la propiedad FText."
					},
					"Key": "asset_localized_text"
				},
				{
					"Source":
					{
						"Text": "Creating text literals in C++ by using the LOCTEXT macros."
					},
					"Translation":
					{
						"Text": "Creación de literales de texto en C++ mediante las macros LOCTEXT las macros LOCTEXT."
					},
					"Key": "cpp_loc_macro"
				},
				{
					"Source":
					{
						"Text": "Dynamically assigning a text from a String Table created in C++."
					},
					"Translation":
					{
						"Text": "Asignación dinámica de un texto a partir de una tabla de cadenas creada en C++."
					},
					"Key": "cpp_string_table_dynamic_load"
				},
				{
					"Source":
					{
						"Text": "Linking texts from a String Table created as uasset."
					},
					"Translation":
					{
						"Text": "Vinculación de textos de una tabla de cadenas creada como uasset."
					},
					"Key": "asset_string_table"
				},
				{
					"Source":
					{
						"Text": "Linking texts from a String Table created in C++ from data loaded from a CSV file."
					},
					"Translation":
					{
						"Text": "Vinculación de textos de una tabla de cadenas creada en C++ a partir de datos cargados desde un archivo CSV."
					},
					"Key": "cpp_string_table_from_csv"
				},
				{
					"Source":
					{
						"Text": "Linking texts from a String Table created in C++ using LOCTABLE macros."
					},
					"Translation":
					{
						"Text": "Vinculación de textos a partir de una tabla de cadenas creada en C++ mediante macros LOCTABLE."
					},
					"Key": "cpp_string_table_from_loc_macro"
				},
				{
					"Source":
					{
						"Text": "Missing text localization - it always falls back to the native language."
					},
					"Translation":
					{
						"Text": "Falta localización de texto - siempre se vuelve al idioma nativo."
					},
					"Key": "missing_localization_text"
				},
				{
					"Source":
					{
						"Text": "Text Localization"
					},
					"Translation":
					{
						"Text": "Localización de textos"
					},
					"Key": "title_text_localization"
				},
				{
					"Source":
					{
						"Text": "Using String Tables:"
					},
					"Translation":
					{
						"Text": "Utilización de tablas de cadenas:"
					},
					"Key": "section_title_string_tables"
				},
				{
					"Source":
					{
						"Text": "Using Text Literals:"
					},
					"Translation":
					{
						"Text": "Uso de literales de texto:"
					},
					"Key": "section_title_text_literals"
				},
				{
					"Source":
					{
						"Text": "Using non-localized text."
					},
					"Translation":
					{
						"Text": "Uso de texto no localizado."
					},
					"Key": "non_localized_text"
				}
			]
		},
		{
			"Namespace": "ST_Weapons",
			"Children": [
				{
					"Source":
					{
						"Text": "axe"
					},
					"Translation":
					{
						"Text": "hacha"
					},
					"Key": "st_cpp_weapons_axe"
				},
				{
					"Source":
					{
						"Text": "bow"
					},
					"Translation":
					{
						"Text": "arco"
					},
					"Key": "st_cpp_weapons_bow"
				},
				{
					"Source":
					{
						"Text": "sword"
					},
					"Translation":
					{
						"Text": "espada"
					},
					"Key": "st_cpp_weapons_sword"
				}
			]
		}
	]
}